In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.random.randint(0,10,(3,3)))
df

   0  1  2
0  1  7  0
1  7  2  6
2  0  1  5

In [4]:
df.loc[0] = df.loc[1] - df.loc[0]
df.loc[1] = df.loc[2] - df.loc[0]
df

   0  1  2
0  6 -5  6
1 -6  6 -1
2  0  1  5

In [5]:
df.loc[:,1] = df.loc[:,1] - df.iloc[:,0]
df.loc[:,2] = df.loc[:,2] - df.iloc[:,0]
#df-df.subtract(df.iloc[0],axis=1) # subtract column
df

   0   1  2
0  6 -11  0
1 -6  12  5
2  0   1  5

In [6]:
data = pd.Series([2,10,np.nan,20,None])
data

0     2.0
1    10.0
2     NaN
3    20.0
4     NaN
dtype: float64

In [7]:
data.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [8]:
data.notnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [9]:
data[data.notnull()]

0     2.0
1    10.0
3    20.0
dtype: float64

In [10]:
data.describe()

count     3.000000
mean     10.666667
std       9.018500
min       2.000000
25%       6.000000
50%      10.000000
75%      15.000000
max      20.000000
dtype: float64

In [11]:
df = pd.DataFrame([[2,10,np.nan,20],[2,10,20,None],[2,3,4,3],[2,25,20,np.nan]])
df

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [12]:
df.describe()

         0          1          2          3
count  4.0   4.000000   3.000000   2.000000
mean   2.0  12.000000  14.666667  11.500000
std    0.0   9.273618   9.237604  12.020815
min    2.0   3.000000   4.000000   3.000000
25%    2.0   8.250000  12.000000   7.250000
50%    2.0  10.000000  20.000000  11.500000
75%    2.0  13.750000  20.000000  15.750000
max    2.0  25.000000  20.000000  20.000000

In [13]:
df.isnull().any() # which column (attribute) is haing null value

0    False
1    False
2     True
3     True
dtype: bool

In [14]:
print(df)
df.dropna() # delete all row which contains null

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

   0  1    2    3
2  2  3  4.0  3.0

In [15]:
df.dropna(how="all") #deletes if all the value is null

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [16]:
df.dropna(thresh=3) # if there is less than 3 value in row then it will delete that row

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [17]:
df.dropna(thresh=4) # if there is less than 4 value in row then it will delete that row

   0  1    2    3
2  2  3  4.0  3.0

In [18]:
#Filling Value

In [19]:
data

0     2.0
1    10.0
2     NaN
3    20.0
4     NaN
dtype: float64

In [20]:
data.fillna(0) # filling null value as 0

0     2.0
1    10.0
2     0.0
3    20.0
4     0.0
dtype: float64

In [21]:
data.fillna(method="ffill") #ffill - Forward Fill
# fill the previous value

0     2.0
1    10.0
2    10.0
3    20.0
4    20.0
dtype: float64

In [22]:
data.fillna(method="bfill") #ffill - Forward Fill
# fill the next value

0     2.0
1    10.0
2    20.0
3    20.0
4     NaN
dtype: float64

In [23]:
df

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [24]:
df.fillna(df.mean())

   0   1          2     3
0  2  10  14.666667  20.0
1  2  10  20.000000  11.5
2  2   3   4.000000   3.0
3  2  25  20.000000  11.5

In [25]:
df.fillna(df.stack().mean())

   0   1          2          3
0  2  10   9.461538  20.000000
1  2  10  20.000000   9.461538
2  2   3   4.000000   3.000000
3  2  25  20.000000   9.461538

In [26]:
df.fillna(method="ffill")

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0  20.0
2  2   3   4.0   3.0
3  2  25  20.0   3.0

In [27]:
df.fillna(method="bfill")

   0   1     2     3
0  2  10  20.0  20.0
1  2  10  20.0   3.0
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [28]:
print(df)
df.fillna(method="ffill",axis=1)

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

     0     1     2     3
0  2.0  10.0  10.0  20.0
1  2.0  10.0  20.0  20.0
2  2.0   3.0   4.0   3.0
3  2.0  25.0  20.0  20.0

In [29]:
df1 = pd.DataFrame(np.random.randint(0,10,(3,3)),columns= list("PQR"))
df2 = pd.DataFrame(np.random.randint(0,10,(3,3)),columns= list("PQR"))

In [30]:
pd.concat([df1,df2],axis=1)

   P  Q  R  P  Q  R
0  8  0  3  6  0  1
1  6  6  2  5  7  8
2  1  4  0  4  4  5

In [31]:
pd.concat([df1,df2],axis=1,ignore_index=True)

   0  1  2  3  4  5
0  8  0  3  6  0  1
1  6  6  2  5  7  8
2  1  4  0  4  4  5

In [32]:
df1 = pd.DataFrame(np.random.randint(0,10,(3,3)),columns= list("PQR"))
df2 = pd.DataFrame(np.random.randint(0,10,(3,4)),columns= list("PRTM"))

In [33]:
pd.concat([df1,df2],axis=1)

   P  Q  R  P  R  T  M
0  8  8  9  3  9  6  1
1  1  7  1  1  9  0  2
2  1  9  2  8  2  2  6

In [34]:
pd.concat([df1,df2],axis=0,join="inner")

   P  R
0  8  9
1  1  1
2  1  2
0  3  9
1  1  9
2  8  2

In [35]:
#merging

In [36]:
df1 = pd.DataFrame({"employee":["bob","alice","july","raj"],"group":["computer enginner","translator","translator","writer"]})
df2 = pd.DataFrame({"employee":["tim","alice","marie","raj","sunil"],"hire_date":[2004,2003,2012,2018,2006]})
print(df1)
print(df2)

  employee              group
0      bob  computer enginner
1    alice         translator
2     july         translator
3      raj             writer
  employee  hire_date
0      tim       2004
1    alice       2003
2    marie       2012
3      raj       2018
4    sunil       2006

In [37]:
pd.merge(df1,df2)

  employee       group  hire_date
0    alice  translator       2003
1      raj      writer       2018

In [38]:
df3 = pd.DataFrame({"group":["computer enginner","translator","writer"],"supervisor":["s1","s2","s3"]})

In [39]:
pd.merge(df1,df3)

  employee              group supervisor
0      bob  computer enginner         s1
1    alice         translator         s2
2     july         translator         s2
3      raj             writer         s3

In [40]:
df5 = pd.DataFrame({"group":["computer enginner","writer","HR","Accounting"],"skills":[["coding", "math"],["language","knowledge"],["knowledge"],["linux","Math"]]})
df5

               group                 skills
0  computer enginner         [coding, math]
1             writer  [language, knowledge]
2                 HR            [knowledge]
3         Accounting          [linux, Math]

In [41]:
pd.merge(df1,df5)

  employee              group                 skills
0      bob  computer enginner         [coding, math]
1      raj             writer  [language, knowledge]

In [42]:
df1 = pd.DataFrame({"employee":["bob","alice","july","raj"],"group":["computer enginner","translator","translator","writer"]})
df2 = pd.DataFrame({"employee":["tim","alice","july","raj","sunil"],"group":["computer enginner","HR","translator","Manager","Programmer"],"hire_date":[2004,2003,2012,2018,2006]})

In [43]:
df1

  employee              group
0      bob  computer enginner
1    alice         translator
2     july         translator
3      raj             writer

In [44]:
df2

  employee              group  hire_date
0      tim  computer enginner       2004
1    alice                 HR       2003
2     july         translator       2012
3      raj            Manager       2018
4    sunil         Programmer       2006

In [45]:
pd.merge(df1,df2,on="employee")

  employee     group_x     group_y  hire_date
0    alice  translator          HR       2003
1     july  translator  translator       2012
2      raj      writer     Manager       2018

In [46]:
df5 = pd.DataFrame({'name':["tim","alice","july","raj","sunil"],'salary':[70000,80000,120000,150000,200000]})
df5

    name  salary
0    tim   70000
1  alice   80000
2   july  120000
3    raj  150000
4  sunil  200000

In [47]:
pd.merge(df2,df5,left_on="employee",right_on="name").drop("name",axis=1)

  employee              group  hire_date  salary
0      tim  computer enginner       2004   70000
1    alice                 HR       2003   80000
2     july         translator       2012  120000
3      raj            Manager       2018  150000
4    sunil         Programmer       2006  200000

In [48]:
#how to read csv file

In [49]:
df = pd.read_csv("areas.csv")
df

      city  area (sq. mi)
0   bhopal        5487945
1  gwalior         213546
2   indore        2365478
3     guna        2145632